; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image3 - mode
	image5 - mode
	infrared2 - mode
	thermograph0 - mode
	infrared4 - mode
	image6 - mode
	infrared1 - mode
	GroundStation3 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star8 - direction
	Star9 - direction
	GroundStation10 - direction
	Star11 - direction
	GroundStation13 - direction
	Star2 - direction
	GroundStation0 - direction
	GroundStation12 - direction
	GroundStation1 - direction
	Star6 - direction
	Star14 - direction
	Planet15 - direction
	Planet16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared1)
	(supports instrument0 image6)
	(supports instrument0 infrared2)
	(supports instrument0 image5)
	(supports instrument0 image3)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet16)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared4)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation12)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star17)
)
(:goal (and
	(pointing satellite0 GroundStation7)
	(have_image Star14 image3)
	(have_image Star14 infrared2)
	(have_image Planet15 infrared4)
	(have_image Planet16 image5)
	(have_image Star17 infrared1)
	(have_image Star17 image6)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (turn_to satellite1 planet15 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 planet15)
   goals met: 0 of 7
4. (turn_to satellite0 star2 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star2)
   goals met: 0 of 7
5. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 7
6. (turn_to satellite0 groundstation7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation7)
   goals met: 1 of 7
7. (turn_to satellite0 planet16 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet16)
   goals met: 0 of 7
8. (take_image satellite0 planet16 instrument0 image5)
   added: (have_image planet16 image5)
   goals met: 1 of 7
9. (turn_to satellite0 groundstation7 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 groundstation7)
   goals met: 2 of 7
10. (turn_to satellite0 star14 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star14)
   goals met: 1 of 7
11. (take_image satellite0 star14 instrument0 image3)
   added: (have_image star14 image3)
   goals met: 2 of 7
12. (take_image satellite0 star14 instrument0 infrared2)
   added: (have_image star14 infrared2)
   goals met: 3 of 7
13. (turn_to satellite0 groundstation7 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation7)
   goals met: 4 of 7
14. (turn_to satellite0 star17 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star17)
   goals met: 3 of 7
15. (take_image satellite0 star17 instrument0 image6)
   added: (have_image star17 image6)
   goals met: 4 of 7
16. (take_image satellite0 star17 instrument0 infrared1)
   added: (have_image star17 infrared1)
   goals met: 5 of 7
17. (turn_to satellite0 groundstation7 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 groundstation7)
   goals met: 6 of 7
18. (turn_to satellite1 star6 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star6)
   goals met: 6 of 7
19. (calibrate satellite1 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 6 of 7
20. (turn_to satellite1 planet15 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet15)
   goals met: 6 of 7
21. (take_image satellite1 planet15 instrument1 infrared4)
   added: (have_image planet15 infrared4)
   goals met: 7 of 7
